; domain
; ==========================================================
; DOMAIN: SATELLITE (ENHSP FIXED)
; ==========================================================

(define (domain satellite)

(:requirements
    :typing
    :negative-preconditions
    :fluents
)

; ==========================================================
;
(:types
    direction
    target ;
)

(:constants
    N NE E SE S SW W NW - direction
)

; ==========================================================
;
(:predicates
    (pointing ?d - direction)
    (visible ?t - target ?d - direction)
    (stored ?t - target)
    (sent ?t - target)

    (hd ?t - target)
    (sd ?t - target)

    (next-right ?from - direction ?to - direction)
    (next-left ?from - direction ?to - direction)

    ;
    (is-north ?d - direction)
)

; ==========================================================
;
(:functions
    (charge)
    (memory-used)
    (max-memory)
    (photo-count)
)

; ==========================================================
;
(:action rotate-right
    :parameters (?from - direction ?to - direction)
    :precondition
    (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (charge) 1)
    )
    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (charge) 1)
    )
)

(:action rotate-left
    :parameters (?from - direction ?to - direction)
    :precondition
    (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (charge) 1)
    )
    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (charge) 1)
    )
)

; ==========================================================
(:action take-picture-hd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (visible ?t ?d)
        (hd ?t)
        (not (stored ?t))
        (not (sent ?t))

        (>= (charge) 2)
        (<= (photo-count) 1) ;
        (<= (+ (memory-used) 10) (max-memory))
    )
    :effect
    (and
        (stored ?t)
        (decrease (charge) 2)
        (increase (photo-count) 1)
        (increase (memory-used) 10)
    )
)

(:action take-picture-sd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (visible ?t ?d)
        (sd ?t)
        (not (stored ?t))
        (not (sent ?t))

        (>= (charge) 2)
        (<= (photo-count) 1) ;
        (<= (+ (memory-used) 3) (max-memory))
    )
    :effect
    (and
        (stored ?t)
        (decrease (charge) 2)
        (increase (photo-count) 1)
        (increase (memory-used) 3)
    )
)

; ==========================================================
(:action send-hd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (is-north ?d)
        (stored ?t)
        (hd ?t)
        (>= (charge) 2)
    )
    :effect
    (and
        (not (stored ?t))
        (sent ?t)

        (decrease (charge) 2)
        (decrease (photo-count) 1)
        (decrease (memory-used) 10)
    )
)

(:action send-sd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (is-north ?d)
        (stored ?t)
        (sd ?t)
        (>= (charge) 2)
    )
    :effect
    (and
        (not (stored ?t))
        (sent ?t)

        (decrease (charge) 2)
        (decrease (photo-count) 1)
        (decrease (memory-used) 3)
    )
)
)

; problem
; ==========================================================
; PROBLEM: MEDIUM
; ==========================================================

(define (problem satellite-medium)

(:domain satellite)

; ==========================================================
; OBJECTS
(:objects
    star1 planet1 junk1 noise2 - target
)

; ==========================================================
; INITIAL STATE
(:init
    ; Начальное направление
    (pointing S)
    ; Указываем, где Земля
    (is-north N)

    ; Видимость
    (visible star1 E)
    (visible planet1 W)

    ; Требования к качеству (перенесено из Goal)
    (hd star1)
    (hd planet1)

    ; Численные переменные
    (= (memory-used) 0)
    (= (max-memory) 13) ; Объем диска
    (= (charge) 75)     ; Стартовый заряд
    (= (photo-count) 0)

    ; Топология компаса (по часовой стрелке)
    (next-right N NE)
    (next-right NE E)
    (next-right E SE)
    (next-right SE S)
    (next-right S SW)
    (next-right SW W)
    (next-right W NW)
    (next-right NW N)

    ; Топология компаса (против часовой стрелки)
    (next-left N NW)
    (next-left NW W)
    (next-left W SW)
    (next-left SW S)
    (next-left S SE)
    (next-left SE E)
    (next-left E NE)
    (next-left NE N)
)

; ==========================================================
; GOAL STATE
(:goal
    (and
        (sent star1)
        (sent planet1)
    )
)

; ==========================================================
; METRIC
; Ищем самый энергоэффективный маршрут
(:metric maximize (charge))

)

; plan
1. (rotate-left s se)
   deleted: (pointing s)
   added: (pointing se)
   changed: (charge) from 75 to 74
   goals met: 0 of 2
2. (rotate-left se e)
   deleted: (pointing se)
   added: (pointing e)
   changed: (charge) from 74 to 73
   goals met: 0 of 2
3. (take-picture-hd star1 e)
   added: (stored star1)
   changed: (charge) from 73 to 71, (photo-count) from 0 to 1, (memory-used) from 0 to 10
   goals met: 0 of 2
4. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   changed: (charge) from 71 to 70
   goals met: 0 of 2
5. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   changed: (charge) from 70 to 69
   goals met: 0 of 2
6. (send-hd star1 n)
   deleted: (stored star1)
   added: (sent star1)
   changed: (charge) from 69 to 67, (photo-count) from 1 to 0, (memory-used) from 10 to 0
   goals met: 1 of 2
7. (rotate-left n nw)
   deleted: (pointing n)
   added: (pointing nw)
   changed: (charge) from 67 to 66
   goals met: 1 of 2
8. (rotate-left nw w)
   deleted: (pointing nw)
   added: (pointing w)
   changed: (charge) from 66 to 65
   goals met: 1 of 2
9. (take-picture-hd planet1 w)
   added: (stored planet1)
   changed: (charge) from 65 to 63, (photo-count) from 0 to 1, (memory-used) from 0 to 10
   goals met: 1 of 2
10. (rotate-right w nw)
   deleted: (pointing w)
   added: (pointing nw)
   changed: (charge) from 63 to 62
   goals met: 1 of 2
11. (rotate-right nw n)
   deleted: (pointing nw)
   added: (pointing n)
   changed: (charge) from 62 to 61
   goals met: 1 of 2
12. (send-hd planet1 n)
   deleted: (stored planet1)
   added: (sent planet1)
   changed: (charge) from 61 to 59, (photo-count) from 1 to 0, (memory-used) from 10 to 0
   goals met: 2 of 2
